[
    {
      "recipe_id": 1,
      "recipe_type": "Dessert",
      "recipe_name": "Gâteau au chocolat",
      "ingredients": {
        "Beurre salé": "200 g",
        "Chocolat": "200 g",
        "Oeuf": "4",
        "Sucre": "150 g",
        "Farine": "80 g"
      },
      "allergens": [],
      "diet": ["végétarien"],
      "steps": [
        "Faire fondre le beurre avec le chocolat.",
        "Battre les oeufs avec le sucre.",
        "Ajouter la farine aux oeufs et au sucre.",
        "Mélanger le beurre / chocolat avec les oeufs/sucre/farine jusqu'à obtenier une pate homogène.",
        "Beurrer et fariner un moule à gateau",
        "Verser le mélange dans le moule et mettre au four à 190 degrés pendant 15 à 20 minutes."
      ],
      "related_recipes":[
        2
      ]
    },
    {
      "recipe_id":2,
      "recipe_type": "Dessert",
      "recipe_name":"Crème anglaise",
      "ingredients":{
        "Lait demi écrémé": "50 cl",
        "Jaune d'oeuf": "4",
        "Sucre": "50 g",
        "Gousse de vanille": "1",
        "Maïzena": "1 cuillère à soupe"
      },
      "allergens": [],
      "diet": ["végétarien"],
      "steps": [
        "Porter à ébullition le lait en ayant pris soin d'y plonger la gousse de vanille fendue en deux dans sa longueur.",
        "Laisser ensuite infuser pendant 10 min, puis retirer la gousse de vanille, et récupérer les grains en la grattant. Délayer ceux-ci dans le lait.",
        "Dans une seconde casserole, fouetter activement les jaunes d'oeuf et le sucre afin que le mélange blanchisse.",
        "Incorporer ensuite petit à petit le lait et rendre l'appareil bien homogène avec le fouet.",
        "Ajouter ensuite la maïzena et réchauffer le mélange à feu moyen.",
        "Sans cesser de remuer, guetter le moment où la crème s'épaissit. Ne pas laisser boullir.",
        "Quand la crème s'épaissit, retirer du feu et fouetter activement.",
        "Réserver dans un bol au frigo.",
        "Mélanger la crème avant de la servir."
      ],
      "related_recipes":[
        1
      ]
    },
    {
      "recipe_id":3,
      "recipe_type": "Plat",
      "recipe_name": "Galettes de sarrasin nature",
      "ingredients": {
        "Farine de sarrasin": "300 g",
        "Eau": "50 cl",
        "Sel fin": "2 pincées",
        "Huile pour cuisson": "10 cl"
      },
      "allergens": [],
      "diet": ["végétarien", "végane"],
      "steps": [
        "Verser toute la farine et le sel dans un saladier",
        "Ajouter de l'eau progressivement et battre au fouet ou au batteur jusqu'à obtenir une pâte pas trop liquide (pas obligé de mettre toute l'eau)",
        "Faire chauffer une poêle à crêpes à grand feu, étaler un peu d'huile sur toute la surface avec du papier cuisine",
        "Une fois la poêle bien chaude, verser environ une louche de pâte et la répartir sur toute la surface de la poêle",
        "Laisser cuire sans retourner jusqu'à ce que les bords se décollent d'eux-mêmes",
        "Sortir la galette et la mettre de côté dans une assiette",
        "Recommencer la cuisson tant qu'il reste de la pâte : voilà une pile de galettes à réchauffer avec un remplissage au choix"
      ],
      "related_recipes": [
        5
      ]
    },
    {
      "recipe_id": 4,
      "recipe_type": "Dessert",
      "recipe_name": "Crumble à la pomme",
      "ingredients": {
        "Pommes": "8",
        "Sucre roux": "50 g",
        "Farine complète": "90 g",
        "Purée de cacahuète": "100 g",
        "Vanille en poudre": "5 ml"
      },
      "allergens": ["cacahuète"],
      "diet": ["végétarien", "végane",],
      "steps": [
        "Préchauffer le four à 180°.",
        "Peler les pommes.",
        "Couper-les en petits morceaux et placez-les dans un plat.",
        "Mélanger le sucre, la farine et la vanille en poudre.",
        "Ajouter la purée de cacahuète.",
        "Malaxer le tout avec les doigts pour obtenir une pâte sableuse.",
        "Rajouter cette pâte au dessus des pommes pelées et coupées.",
        "Faire cuire environ 20 min jusqu'à ce que la pâte soit bien dorée."
      ],
      "related_recipes":[
        1, 2
      ]
    },
    {
      "recipe_id": 5,
      "recipe_type": "Plat",
      "recipe_name": "Quiche d'aubergine au fromage de chèvre",
      "ingredients": {
        "Pâte feuilletée": "1",
        "Ravier de chèvre": "1",
        "Gousses d'ail": "2",
        "Aubergine": "1",
        "Tomates": "2",
        "Origan": "1 cs.",
        "Herbes de Provence": "1 cs.",
        "Gruyère râpé": "100g",
        "Huile d'olive": "2 cs."
      },
      "allergens": [],
      "diet": ["végétarien"],
      "steps": [
        "Préchauffer le four à 180°C",
        "Laver l'aubergine et découper-la en rondelles de 0,3 mm d'épaisseur.",
        "Laver les tomates, découper-les en rondelles fines",
        "Eplucher les gousses d'ail et couper-les en petits morceaux.",
        "Faire chauffer l'huile d'olive dans une poêle et y faire revenir les rondelles d'aubergine.",
        "Eponger les rondelles avec du papier essuie-tout.",
        "Préparer un plat à quiche, y étalez la pâte, tapir le fond avec le fromage de chèvre.",
        "Disposer par-dessus les rondelles d'aubergine puis les rondelles de tomates.",
        "Saupoudrer le tout d'ail, d'herbes de Provence, de gruyère râpé et d'origan.",
        "Mettre au four pendant 20 min mais surveillez la cuisson car dès que la quiche prend une couleur bien dorée, sortez-la."
      ],
      "related_recipes":[
        3
      ]
    }
  ]